{
  "title": "Suki na Ko ga Megane wo Wasureta",
  "description": "Komura is a middle school boy who is head-over-heels in love with his next-seat neighbor Mie, a girl with terrible eyesight who just can't get used to carrying her glasses, often leaving them at home, or accidentally breaking them. He opts to help her as much as he possibly can, and through those efforts, she begins getting acquainted with his kindness. Will she reciprocate?\n\nA delightfully charming romantic comedy about a boy who only has eyes for the girl who always forgets her glasses!\n\nWith the new school year comes a new homeroom, new classmates, and a new desk for the timid Komura. But any trepidation he might've felt quickly dissipates when he catches sight of Mie, his new seat neighbor.\n\nApt to quietly blurt out the most random things, the quirky Mie wears thick glasses that accentuate her lovely eyes, making Komura’s heart skip a beat!\n\nUnfortunately, Mie is pathologically forgetful and can never seem to remember to bring her glasses to class. It's not all bad, though! Her resulting squinty, mean-girl face sends Komura’s heart into overdrive too!\n\nWhile Komura is keen to help out and share his textbooks with Mie, will his heart give out from the almost daily strain of being up close and personal with his crush?!\n\nOfficial Raw: https://magazine.jp.square-enix.com/joker/series/sukimega/\nBookwalker: https://bookwalker.jp/series/192723/list/\nMangaUp: https://global.manga-up.com/manga/143\nAmazon US: https://www.amazon.com/dp/B09TZYH2CF\n\nSho Habby Scans Discord: https://discord.gg/GdV76sQs7d",
  "artist": "Fujichika Koume",
  "author": "Fujichika Koume",
  "cover": "https://raw.githubusercontent.com/ShoHabbyUploads/ShoHabbyCubariSources/refs/heads/main/Covers/Suki_na_Ko_ga_Megane_wo_Wasureta.png",
  "chapters": {
    "87.5": {
      "title": "Volume Extras",
      "volume": "9",
      "last_updated": "1747588838",
      "groups": {
        "Sho Habby Scans": "/proxy/api/imgchest/chapter/ljyqxo5nn42"
      }
    }
  }
}